[
    {   "_id": "A101", 
        "title": "Propulsion Assignment", 
        "course": "RS101",
        "description": "Rocket propulsion is the force used by the rocket to take off from the ground. It is based on Newton's third law of motion principle. Liquid fuel, solid fuel, cold gas and ion are the types of rocket propulsion. Acceleration depends on the exhaust velocity, burning of the fuel, and mass of the rocket.",
        "points": 50,
        "dueDate": "2020-03-14",
        "availableFromDate": "2020-03-07",
        "availableUntilDate": "2020-03-14"
    },
    {   "_id": "A102", 
        "title": "Combustion Analysis", 
        "course": "RS101",
        "description": "Combustion analysis is a standard method of determining a chemical formula of a substance that contains hydrogen and carbon. First, a sample is weighed and then burned in a furnace in the presence of excess oxygen. All of the carbon is converted to carbon dioxide, and the hydrogen is converted to water in this way.",
        "points": 100,
        "dueDate": "2022-10-10",
        "availableFromDate": "2019-08-01",
        "availableUntilDate": "2023-09-03"
    },
    {   "_id": "A103", 
        "title": "Nozzle Design Project", 
        "course": "RS101",
        "description": "Nozzles are made up of three main components: the inlet, throat and outlet which are used for controlling speed and pressure of the fluid. Various considerations such as flow rate requirements, pressure conditions, fluid properties and desired output significantly influence the design of nozzles.",
        "points": 30,
        "dueDate": "2024-03-21",
        "availableFromDate": "2024-03-01",
        "availableUntilDate": "2024-03-22"
    },
    {   "_id": "A201", 
        "title": "Aerodynamics Quiz", 
        "course": "RS102",
        "description": "Aerodynamics is the way objects move through air. The rules of aerodynamics explain how an airplane is able to fly. Anything that moves through air is affected by aerodynamics, from a rocket blasting off, to a kite flying. Since they are surrounded by air, even cars are affected by aerodynamics.",
        "points": 10,
        "dueDate": "2024-06-11",
        "availableFromDate": "2017-05-17",
        "availableUntilDate": "2050-11-21"
    },
    {   "_id": "A202", 
        "title": "Flow Analysis", 
        "course": "RS102",
        "description": "Fluid Flow describes the movement of fluids produced by a pressure gradient, where pressure gradients are differences in pressure across a surface. Flow rate refers to the volume of a fluid passing through a given cross-sectional area during a specific time interval. Flow rate has a corresponding equation of Q = V t ",
        "points": 100,
        "dueDate": "2025-05-07",
        "availableFromDate": "2025-04-07",
        "availableUntilDate": "2025-06-01"
    },
    {   "_id": "A203", 
        "title": "Heating Analysis", 
        "course": "RS102" },
    {   "_id": "A301",  
        "title": "Structural Design Task", 
        "course": "RS103",
        "description": "Heat, energy that is transferred from one body to another as the result of a difference in temperature. If two bodies at different temperatures are brought together, energy is transferred—i.e., heat flows—from the hotter body to the colder.",
        "points": 50,
        "dueDate": "2024-07-25",
        "availableFromDate": "2024-07-24",
        "availableUntilDate": "2024-07-25"
    },
    {   "_id": "A302", 
        "title": "Orbital Calculations", 
        "course": "RS103",
        "description": "The orbit formula, r = (h2/μ)/(1 + ecos θ), gives the position of body m2 in its orbit around m1 as a function of the true anomaly. For many practical reasons, we need to be able to determine the position of m2 as a function of time.",
        "points": 50,
        "dueDate": "2024-06-22",
        "availableFromDate": "2024-04-30",
        "availableUntilDate": "2024-06-23"
    },
    {   "_id": "A303", 
        "title": "Systems Engineering Exam", 
        "course": "RS103",
        "description": "Systems engineering is an interdisciplinary field of engineering and engineering management that focuses on how to design, integrate, and manage complex systems over their life cycles. At its core, systems engineering utilizes systems thinking principles to organize this body of knowledge.",
        "points": 100,
        "dueDate": "2023-12-05",
        "availableFromDate": "2023-11-10",
        "availableUntilDate": "2023-12-31"
    }
]